app/Controllers/Contato.php

INSERT INTO `contatos` (`name`, `email`, `message`) VALUES ('teste', 'teste@teste.com', 'teste1')
---
    public function submit()
    {
        $request = service('request');

        $data = [
            'name'    => $request->getPost('name'),
            'email'   => $request->getPost('email'),
            'message' => $request->getPost('message'),
        ];

        $validation = \Config\Services::validation();
        $validation->setRules([
            'name'    => 'required|min_length[3]',
            'email'   => 'required|valid_email',
            'message' => 'required|min_length[5]',
        ]);

        if (!$validation->run($data)) {
            return redirect()->back()->withInput()->with('errors', $validation->getErrors());
        }

        $contactModel = new contatoModel();
        $contactModel->insert($data);